Vulnerability Test Results/artillery-load-test.yml
# DentAI — Artillery Load Test Configuration
# Project: CBCT AI Segmentation Platform
# Generated: 2026-08-05
#
# Usage:
#   npm install -g artillery
#   artillery run artillery-load-test.yml
#   artillery run artillery-load-test.yml --output results/artillery-report.json
#   artillery report results/artillery-report.json

config:
  target: "http://localhost:8000"
  http:
    timeout: 30
  defaults:
    headers:
      Accept: "application/json"

  # ── Phases ────────────────────────────────────────────────────────────────
  phases:
    # Phase 1: Baseline (100 users, 60s)
    - name: "Baseline Load"
      duration: 60
      arrivalRate: 100
      rampTo: 100

    # Phase 2: Stress (ramp to 500 users)
    - name: "Stress Ramp-Up"
      duration: 60
      arrivalRate: 100
      rampTo: 500

    # Phase 3: Spike (sudden 50 → 500)
    - name: "Spike"
      duration: 30
      arrivalRate: 500

    # Phase 4: Recovery
    - name: "Recovery"
      duration: 30
      arrivalRate: 50

    # Phase 5: Endurance (100 users, 30 min)
    - name: "Endurance"
      duration: 1800
      arrivalRate: 100

  # ── Custom Metrics ─────────────────────────────────────────────────────────
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

  # ── Thresholds ─────────────────────────────────────────────────────────────
  ensure:
    p95: 2000
    p99: 5000
    maxErrorRate: 10

  # ── Variables ──────────────────────────────────────────────────────────────
  variables:
    scan_ids: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    emails:
      - "doctor1@test.com"
      - "doctor2@test.com"
      - "doctor3@test.com"
    password: "TestPass123!"

# ── Scenarios ──────────────────────────────────────────────────────────────────
scenarios:
  # ── Scenario 1: Health Check (weight: 10%) ──────────────────────────────────
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          name: "GET /health"
          expect:
            - statusCode: 200
            - hasProperty: "message"

  # ── Scenario 2: Authentication Flow (weight: 30%) ───────────────────────────
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/login"
          name: "POST /login - valid credentials"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "email={{ emails[0] }}&password={{ password }}"
          capture:
            - json: "$.success"
              as: "loginSuccess"
          expect:
            - statusCode: 200

      - think: 1

      - post:
          url: "/login"
          name: "POST /login - invalid credentials"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "email=invalid@test.com&password=wrongpass"
          expect:
            - statusCode: 200
            - hasProperty: "success"

      - think: 0.5

      - post:
          url: "/signup"
          name: "POST /signup - registration attempt"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "name=Test Doctor&license=LIC123&email=newdoc{{ $randomNumber(1000,9999) }}@test.com&password={{ password }}"
          expect:
            - statusCode: 200

  # ── Scenario 3: Scan History (weight: 25%) ──────────────────────────────────
  - name: "Scan History"
    weight: 25
    flow:
      - get:
          url: "/scans"
          name: "GET /scans"
          expect:
            - statusCode: 200
            - hasProperty: "scans"

      - think: 0.5

      - get:
          url: "/stl/{{ scan_ids[0] }}"
          name: "GET /stl/{id}"

  # ── Scenario 4: Profile Operations (weight: 20%) ────────────────────────────
  - name: "Profile Operations"
    weight: 20
    flow:
      - post:
          url: "/fetch_profile"
          name: "POST /fetch_profile"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "id=1"
          expect:
            - statusCode: 200

      - think: 0.3

      - post:
          url: "/fetch_credentials"
          name: "POST /fetch_credentials"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "doctor_id=1"
          expect:
            - statusCode: 200

  # ── Scenario 5: Password Reset Flow (weight: 5%) ────────────────────────────
  - name: "Password Reset"
    weight: 5
    flow:
      - post:
          url: "/forgot-password"
          name: "POST /forgot-password"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "email=doctor1@test.com"
          expect:
            - statusCode: 200

  # ── Scenario 6: Export Endpoints (weight: 10%) ──────────────────────────────
  - name: "Export Operations"
    weight: 10
    flow:
      - get:
          url: "/stl-region/1/full"
          name: "GET /stl-region/{id}/full"

      - think: 1

      - get:
          url: "/export-dicom/1/condylar_head_L"
          name: "GET /export-dicom/{id}/{region}"
